{
  "skills": [
    {
      "name": "Python",
      "fullName": "Python Programming",
      "rating": 7,
      "ratingExplanation": "o1 placeholder: Compared to a mid-level Python developer, I'm confident in data manipulation, building small-scale apps, and using libraries like TensorFlow and Pandas. I need more experience with production-level, large-scale architecture.",
      "content": [
        {
          "type": "paragraph",
          "text": "Experience with basic Python programming concepts, as well as using AI Python libraries such as Tensorflow, Pandas or langchain.<br/>I also have great experiences coding out of my reach projects using the last genAI models. I also know how to use Github."
        }
      ]
    },
    {
      "name": "Data Science",
      "fullName": "Data Science",
      "rating": 6,
      "ratingExplanation": "o1 placeholder: I compare myself to a standard Data Scientist with a few years of experience. I'm solid on fundamentals (stats, cleaning, and simple ML), but I’m still learning advanced production workflows.",
      "content": [
        {
          "type": "paragraph",
          "text": "Experience in applying data science methodologies for data preprocessing, particularly in AI training, as well as using Python libraries such as Pandas, NumPy, and Scikit-learn for data manipulation, cleaning, and creating predictive models.<br/>Combined with a strong understanding of statistics and cognitive biases, I do best in projects involving human (questionnaire/qualitative data) or physiological data (EEG, ECG)."
        }
      ]
    },
    {
      "name": "Statistics",
      "fullName": "Statistics",
      "rating": 8,
      "ratingExplanation": "o1 placeholder: I have a strong academic background. I can competently apply regression, ANOVA, etc. I'd like more in-depth projects dealing with huge datasets to broaden my expertise.",
      "content": [
        {
          "type": "paragraph",
          "text": "Solid theoretical foundation in statistical methods, including regression analysis, T-tests, χ² tests, ANOVA, and ANCOVA. Skilled in applying these techniques to interpret and analyze data effectively."
        },
        {
          "type": "heading",
          "text": "Software Expertise"
        },
        {
          "type": "paragraph",
          "text": "Experience with both programming-based and GUI-based statistical software:<br/><br/>Programming-Based Tools:<br/>- R - Advanced statistical computing and graphical representation.<br/>- Python - For data preprocessing.<br/><br/>GUI-Based Tools:<br/>- Jamovi - Open-source software offering an easy-to-use interface for statistical analysis, often compared to SPSS.<br/>- G*Power - Specialized in power analysis, particularly useful for small-sample studies."
        },
        {
          "type": "heading",
          "text": "Small Sample Specialization"
        },
        {
          "type": "paragraph",
          "text": "Focus on small-sample (1 < n < 10) analyses, ensuring robust statistical interpretations despite limited data. Expertise includes visual and mathematical interpretation of results, and drawing conclusions about pseudo-causalities."
        }
      ]
    },
    {
      "name": "AI",
      "fullName": "Artificial Intelligence",
      "rating": 7,
      "ratingExplanation": "o1 placeholder: I compare myself to a junior-level AI engineer. I'm well-versed in theory and have built small CNN/FNN projects, but not an industry-level expert yet.",
      "content": [
        {
          "type": "heading",
          "text": "Machine Learning"
        },
        {
          "type": "paragraph",
          "text": "Combined with a strong understanding of statistics and cognitive biases, I excel in projects involving human data. I spent 20-25h studying 'Artificial Intelligence: A Modern Approach' and completing projects applying what I learned."
        },
        {
          "type": "image",
          "src": "Projects Data/Artificial Intelligence A Modern Approach.png",
          "description": "Cover of 'Artificial Intelligence: A Modern Approach', used in my study projects."
        },
        {
          "type": "heading",
          "text": "Deep Learning"
        },
        {
          "type": "paragraph",
          "text": "In my studies and internships, I learned to code basic deep learning AIs such as a cat/dog classifier (CNN), a benign/malignant breast tumor classifier (FNN), and a mouse movement predictor (1D CNN)."
        }
      ]
    },
    {
      "name": "Prompt Engineering",
      "fullName": "Prompt Engineering for genAI applications",
      "rating": 10,
      "ratingExplanation": "o1 placeholder: I've spent extensive hours crafting prompts for real projects and took formal Prompt Engineering courses. There's always more to learn, but I'm quite advanced here.",
      "content": [
        {
          "type": "paragraph",
          "text": "I've managed a few projects involving crafting and refining prompts for genAI for my internship at Procter&Gamble. Those projects were mostly exploratory, trying to see what could be automated with GenAI.<br/I also completed Prompt Engineering courses at Coursera and have tested generative AI models (mostly OpenAI ones) with almost every task that has been assigned to me since November 2022."
        }
      ]
    },
    {
      "name": "Knowledge systems",
      "fullName": "Knowledge Management systems",
      "rating": 9,
      "ratingExplanation": "o1 placeholder: From my time at Procter&Gamble as a project manager for a KMS, I've grown comfortable structuring knowledge, using ontologies, etc. Still exploring advanced graph-based solutions.",
      "content": [
        {
          "type": "paragraph",
          "text": "Knowledge Management Systems (KMS) focus on extracting, structuring, and operationalizing information; tools in this field include knowledge graphs and ontologies. At Procter&Gamble, my main role was to be a project manager for a KMS project, so I'm quite familiar with how they work, and how genAI can be applied to them."
        },
        {
          "type": "paragraph",
          "text": "I've also been gathering all the knowledge I've gathered so far in a 'second brain' in Obsidian, a sofware for note taking that allows links and graphs visualization.<br/>I've also been checking how we can apply genAI to such a database, for either creation of new data, or recollection of existing material."
        },
        {
          "type": "image",
          "src": "Projects Data/ObsidianGraph.png",
          "description": "My Obsidian knowledge graph (02/2025)."
        }
      ]
    },
    {
      "name": "HCI / UX",
      "fullName": "Human-Computer Interaction / User Experience Research",
      "rating": 8,
      "ratingExplanation": "o1 placeholder: I have strong user research experience from P&G and Pixminds. I'd like to deepen my design system expertise but thrive in user needs extraction.",
      "content": [
        {
          "type": "paragraph",
          "text": "User experience and human-machine interface is a central aspect of my master degree.In addition to formal coursework, I served as a UX lead during my time at Procter & Gamble and worked extensively as a UX designer/researcher at Pixminds.<br/>I have a strong understanding of the key concepts of UX research and how to apply them. I particularly thrive in user needs extraction and qualitative data analysis"
        }
      ]
    },
    {
      "name": "Research Methodology",
      "fullName": "Research Methodology",
      "rating": 8,
      "ratingExplanation": "o1 placeholder: Academically well-trained (MSc in Cognitive Sciences). Industry-level experience is more limited, but I have proven capability in experiment design, literature reviews, etc.",
      "content": [
        {
          "type": "paragraph",
          "text": "I developed strong research methodology skills during my Master’s in Cognitive Sciences, particularly through my master’s thesis, where I learned to review literature, develop a testing protocol, as well as experiment design. <br/>The thesis was about 'Building a methodology for the detection of biomarkers of Mind Wandering using a EEG'. Overall I have a good understanding of the research process, and where to find information in the scientific literature, especially for cognitive sciences."
        }
      ]
    },
    {
      "name": "Cognitive sciences & Neurosciences",
      "fullName": "Cognitive sciences & Neurosciences Knowledge",
      "rating": 8,
      "ratingExplanation": "o1 placeholder: Extensive theoretical foundation from my studies in Psychology and Cognitive Sciences. I'd like more hands-on neuroscience R&D.",
      "content": [
        {
          "type": "paragraph",
          "text": "Throughout my bachelor's in psychology and my master degree, I've acquired strong knowledge of the functions of the brain, their neuroanatomy, and their limitations. The specialization of the master degree trains us to learn from the neuronal structures and models associated with cognitive functions to inspire the next generation of AI.<br/>For example, I'm familiar with the models of perception, memory, attention, language, decision-making and emotions."
        }
      ]
    },
    {
      "name": "Soft Skills",
      "fullName": "Soft Skills",
      "rating": 9,
      "ratingExplanation": "o1 placeholder: Compared to most colleagues, I have strong interpersonal skills, empathy, and team spirit. There's still room for growth in leadership roles.",
      "content": [
        {
          "type": "paragraph",
          "text": "Coming both from my personal interests and training in psychology, I've developed strong interpersonal skills, such as active listening, empathy, and caring. I am a strong team player, prioritizing collective success over individual achievements.<br/>Outside work, I'm also a trained Person of Trust and a psychological first aid provider."
        }
      ]
    },
    {
      "name": "Applied Cognitive Sciences to AI",
      "fullName": "Applied Cognitive Sciences to AI",
      "rating": 7,
      "ratingExplanation": "o1 placeholder: Bridging academic cognitive science with practical AI. I'd like real-world, large-scale projects to sharpen these skills.",
      "content": [
        {
          "type": "paragraph",
          "text": "The idea is to combine my knowledge in Cognitive Sciences & Neurosciences with practical AI engineering to build more robust, biologically inspired machine learning models. <br/><br/>Example: Creating a RAG genAI system based on the brain dual encoding of events as 'facts' and 'emotions' (those have 2 differents neural pathways in the brain), to enhance memorization, provide adaptative recalls and speed up the process of searching memory."
        }
      ]
    },
    {
      "name": "Data Visualization",
      "fullName": "Data Visualization",
      "rating": 8,
      "ratingExplanation": "o1 placeholder: I enjoy making sense of complex data with visual tools (Gephi, etc.). I'd like to get more advanced with dynamic libraries (e.g. D3.js).",
      "content": [
        {
          "type": "paragraph",
          "text": "I have some experience in data visualization, especially for graph data using Gephi, or using statistical tools (developped in the Statistics skill). I find it especially rewarding to create visual representations of complex data and processes, and I aim to further specialize in this field"
        },
        {
          "type": "heading",
          "text": "Projects"
        },
        {
          "type": "paragraph",
          "text": "Data Science for Mental Health Practice in France"
        },
        {
          "type": "image",
          "src": "Projects Data/DS_psy.png",
          "description": "One example of graph made with Gephi, about Mental health techniques used in France. <a href=\"https://touyette.github.io/Notion-Dynamic-Skill-HTML/Projects%20Data/PsynetOnly%2CJaccard5%2CUnionsize10%2Coccurence2%2CJifanYu.svg\">Detailed view of the graph</a>"
        }
      ]
    },
    {
      "name": "Project Management in Innovation",
      "fullName": "Project Management & Innovation",
      "rating": 8,
      "ratingExplanation": "o1 placeholder: Nine months of real experience at P&G, plus academic group projects. I’m comfortable coordinating cross-functional teams but always room to improve in scaling innovation.",
      "content": [
        {
          "type": "paragraph",
          "text": "9 months of experience in managing innovative projects, particularly in AI and digital transformation at Procter&Gamble. Focused on agile / scrum methodologies.<br/>My versatile profile fits well the job of a project manager, as I'm able to understand most actors problems, as well as come up with creative solutions."
        }
      ]
    }
  ],

  "relationships": [
    {
      "source": "Python",
      "target": "Data Science",
      "distance": 70
    },
    {
      "source": "Python",
      "target": "AI",
      "distance": 70
    },
    {
      "source": "Data Science",
      "target": "AI",
      "distance": 70
    },
    {
      "source": "Data Science",
      "target": "Statistics",
      "distance": 70
    },
    {
      "source": "Statistics",
      "target": "Research Methodology",
      "distance": 70
    },
    {
      "source": "Cognitive sciences & Neurosciences",
      "target": "Research Methodology",
      "distance": 70
    },
    {
      "source": "Cognitive sciences & Neurosciences",
      "target": "Soft Skills",
      "distance": 70
    },
    {
      "source": "AI",
      "target": "Prompt Engineering",
      "distance": 70
    },
    {
      "source": "Data Science",
      "target": "Knowledge systems",
      "distance": 70
    },
    {
      "source": "Cognitive sciences & Neurosciences",
      "target": "HCI / UX",
      "distance": 70
    },
    {
      "source": "Data Visualization",
      "target": "HCI / UX",
      "distance": 70
    },
    {
      "source": "Cognitive sciences & Neurosciences",
      "target": "Prompt Engineering",
      "distance": 70
    },
    {
      "source": "AI",
      "target": "Applied Cognitive Sciences to AI",
      "distance": 70
    },
    {
      "source": "Cognitive sciences & Neurosciences",
      "target": "Applied Cognitive Sciences to AI",
      "distance": 70
    },
    {
      "source": "Data Visualization",
      "target": "Python",
      "distance": 70
    },
    {
      "source": "Data Visualization",
      "target": "Data Science",
      "distance": 70
    },
    {
      "source": "Project Management in Innovation",
      "target": "Soft Skills",
      "distance": 70
    },
    {
      "source": "Cognitive sciences & Neurosciences",
      "target": "Knowledge systems",
      "distance": 70
    }
  ]
}
