[
    {
        "name": "AI",
        "fullName": "Artificial Intelligence",
        "size": 8,
        "description": "TBC",
        "projects": [
            {
                "title": "AI Chatbot Example",
                "url": "https://touyette.github.io/Notion-Dynamic-Skill-HTML/Demos/TestDemo.mp4",
                "description": "An AI-driven chatbot built using natural language processing techniques."
            }
        ]
    },
    {
        "name": "Python",
        "fullName": "Python Programming",
        "size": 4,
        "description": "Experience with basic Python programming concepts, including data structures, functions, and object-oriented programming. I've also have some knowledge with AI Python libraries for such as Tensorflow, Pandas or langchain. An AI engineer will still be more efficient, but I sure can understand his issues."
    },
    {
        "name": "Prompt Engineering",
        "fullName": "Prompt Engineering for genAI applications ",
        "size": 10,
        "description": "I've managed a few projects involving crafting and refining prompts for genAI for my last internship, on top of following Prompt Engineering classes at Coursera. I've also been limit testing the models (mostly OpenAI ones) with almost every task that has been assigned to me since November 2022"
    },
    {
        "name": "ML",
        "fullName": "Machine Learning",
        "size": 6,
        "description": "To complete my cursus, I wanted to dig deeper on the technical side of AI, particularly what has been done before the Transformers/genAI revolution. To do so, I spent 20-25h studying a handbook of AI's: 'Artificial Intelligence: A Modern Approach', recommended to me by Thomas Winters (Post-Doctoral Researcher at KU Leuven, CS department). I've used this time to complete a handful of projects to apply what I've learned. Again the idea is to be able to understand a Data Scientist/AI engineer perspective, not replace them."
    },
    {
        "name": "2nd Brain",
        "fullName": "Second Brain in Obsidian",
        "size": 7,
        "description": "I trying to gather all the knowledge I've gathered so far in 'second brain' in Obsidian. I've always been interested in gathering everything in one place."
    },
    {
        "name": "UX",
        "fullName": "User Experience Research/Design",
        "size": 8,
        "description": "UX is an important aspect of my master degree. I've been a UX leader, as one of my 3 roles in my stay at Procter&Gamble, and I've worked fully as a UX designer/researcher at Pixminds. I have a strong understanding of the key concepts of UX and how to apply them."
    },
    {
        "name": "Research Methodology",
        "fullName": "Research Methodology",
        "size": 8,
        "description": "I developed strong research methodology skills during my Master’s in Cognitive Science, particularly through my master’s thesis, where I learn to do a literature review, develop a testing protocol, as well as experiment design. Overall I have a good understanding of the research process, and where to find information in the scientific literature."
    },
    {
        "name": "Cognitive science & Neurosciences",
        "fullName": "TBC",
        "size": 8,
        "description": "From my bachelor in psychology and my master degree, I've acquired strong knowledge in the functions of the brain, its neuroanatomy and its limitations."
    },
    {
        "name": "Soft Skills",
        "fullName": "Soft Skills",
        "size": 9,
        "description": "Coming both from my personality and training in psychology. I've developed strong interpersonal skills, such as active listening, empathy and caring. I'm still learning to better communicate (but honestly, who shouldn't?). I'm also a team player, I'll raise a concern if I believe the team overlooked it, and I can let go of my opinion if the team agrees on another one. Overall, the team success matters more than my own."
    },
    {
        "name": "Statistics",
        "fullName": "Statistics",
        "size": 9,
        "description": "Solid theoretical foundation in statistical methods, including regression analysis, T-tests, χ² tests, ANOVA, and ANCOVA. Skilled in applying these techniques to interpret and analyze data effectively.\n\nSoftware Expertise:\nExperience with both programming-based and GUI-based statistical software:\n\nProgramming-Based Tools:\n- R - Advanced statistical computing and graphical representation.\n- Python - For data preprocessing.\n\nGUI-Based Tools:\n- Jamovi - Open-source software offering an easy-to-use interface for statistical analysis, often compared to SPSS.\n- G*Power - Specialized in power analysis, particularly useful for small-sample studies.\n\nSpecialization:\nFocus on small-sample (e.g., n = 1) analyses, ensuring robust statistical interpretations despite limited data. Expertise includes visual and mathematical interpretation of results, and drawing conclusions about pseudo-causalities."
    },
    {
        "name": "Data Science",
        "fullName": "Data Science",
        "size": 9,
        "description": "Proficient in applying data science methodologies for data preprocessing, particularly in AI training, exploration, and analysis. Experienced in using Python libraries such as Pandas, NumPy, and Scikit-learn for data manipulation, cleaning, and creating predictive models."
    },
    {
        "name": "KMS - knowledge management system",
        "fullName": "TBC",
        "size": 9,
        "description": "TBC"
    }
]
